app/views/posts/index.html.haml

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
---
        %p.comment Comments
        -post.comments.each do |c|