app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("username", "body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", " "], ["body", " "], ["post_id", 1], ["created_at", "2019-04-01 03:57:07.875635"], ["updated_at", "2019-04-01 03:57:07.875635"]]
---
    def create
        @user = current_user
        @post = Post.find(params[:post_id])
        if !params[:comment].empty? && !params[:comment][:body].strip.empty?
            values = {}
            values[:body] = comments_params[:body]
            values[:user_id] = current_user.id
            @comment = @post.comments.create(values)