app/controllers/posts_controller.rb

  def index
    @user = current_user
    i_params = index_params
    # Search term entered
    if !i_params[:search].nil?
      tag_ids = []
      Post.all.each do |p|
---
SELECT "posts".* FROM "posts"

  def edit
    id = params[:id]
    @post = Post.find(id)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @user = current_user
    @post = Post.new(post_params)
    @post.user = current_user
    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("caption", "location", "time", "tags", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["caption", "test"], ["location", ""], ["time", ""], ["tags", ""], ["created_at", "2019-03-30 20:59:24.049453"], ["updated_at", "2019-03-30 20:59:24.049453"]]

  def destroy
    respond_to do |format|
      if current_user.id == @post.user_id
        byebug
        @post.destroy
---
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]